{
  "title": "Mobile App Developer (ReactJS, React Native ) - Bangalore, India (Onsite)",
  "company": "Unknown Company",
  "location": "undefined, undefined",
  "description": "Company Description\nRalph Lauren Corporation (NYSE:RL) is a global leader in the design, marketing\nand distribution of premium lifestyle products in five categories: apparel,\naccessories, home, fragrances, and hospitality. For more than 50 years, Ralph\nLauren's reputation and distinctive image have been consistently developed\nacross an expanding number of products, brands and international markets. The\nCompany's brand names, which include Ralph Lauren, Ralph Lauren Collection,\nRalph Lauren Purple Label, Polo Ralph Lauren, Double RL, Lauren Ralph Lauren,\nPolo Ralph Lauren Children, Chaps, among others, constitute one of the world's\nmost widely recognized families of consumer brands. At Ralph Lauren, we unite\nand inspire the communities within our company as well as those in which we\nserve by amplifying voices and perspectives to create a culture of belonging,\nensuring inclusion, and fairness for all. We foster a culture of inclusion\nthrough: Talent, Education & Communication, Employee Groups and Celebration.\n\nPosition Overview\nRalph Lauren is seeking an experienced, self-directed, and highly motivated\nSenior Mobile App Developer to join our dynamic team. In this key role, you will\nbe responsible for leading the development and maintenance of high-quality\nmobile applications using React Native and React.js. Collaborating closely with\ncross-functional teams, including Product Management, Design, and Engineering,\nyou will play a vital role in creating seamless and innovative mobile\nexperiences for Ralph Lauren's customers.\n\nEssential Duties & Responsibilities\n- Lead and mentor a team of React Native developers, providing technical\nguidance, code reviews, and support to ensure high-quality deliverables. -\nInvolve in architect, design, and develop robust, scalable, and maintainable\nmobile applications using React Native. - Collaborate closely with product\nmanagers, designers, and other stakeholders to define project requirements,\ntechnical solutions, and delivery timelines. - Drive continuous improvement\ninitiatives, including process optimization, code refactoring, and adoption of\nbest practices to enhance team productivity and code quality. - Stay updated\nwith the latest trends, technologies, and best practices in mobile development,\nand actively contribute to knowledge sharing within the team. - Participate in\nsprint planning, daily stand-ups, and retrospectives to track project progress,\nidentify potential risks, and propose solutions. - Troubleshoot technical\nissues, conduct root cause analysis, and implement effective solutions to ensure\ntimely resolution. - Collaborate with backend developers to integrate mobile\napplications with server-side APIs and services. - Ensure compliance with coding\nstandards, performance guidelines, and security policies throughout the\ndevelopment lifecycle. - Contribute to the development of technical\ndocumentation, including architecture diagrams, API specifications, and\ndeployment guides.\n\nExperience, Skills & Knowledge\n- Bachelor's degree in Computer Science, Engineering, or a related field. - 6+\nyrs of experience in mobile application development using React Native, with a\nstrong portfolio of successfully delivered projects. - Extensive knowledge of\nJavaScript, ES6/ES7, TypeScript, and related frontend technologies. - Hands-on\nexperience with state management libraries such as Redux or MobX. - Solid\nunderstanding of RESTful APIs, asynchronous programming, and networking\nconcepts. - Experience with debugging tools, performance optimization\ntechniques, and automated testing frameworks. - Strong leadership skills with\nthe ability to inspire and motivate team members, foster a collaborative\nenvironment, and drive results. - Excellent communication skills, both verbal\nand written, with the ability to effectively communicate technical concepts to\nnon-technical stakeholders. - Proven ability to prioritize tasks, manage\nmultiple projects simultaneously, and meet tight deadlines in a fast-paced\nenvironment. - Experience working in an Agile development environment, using\ntools like Jira, Git, and Confluence. - Familiarity with native mobile\ndevelopment (iOS/Android) and cross-platform development frameworks (e.g.,\nFlutter) is a plus. - Experience architecting and building apps, released in\nboth the App Store and Play Store - Passion for learning and sharing knowledge,\nwith a proactive attitude towards personal and professional growth.",
  "requirements": [],
  "postedAt": "2025-01-25T20:09:43.544Z",
  "type": "full-time",
  "remote": false
}