{
  "title": "ReactJS Developer",
  "company": "Unknown Company",
  "location": "undefined, undefined",
  "description": "About Us\n\nHighRadius, a renowned provider of cloud-based Autonomous Software for the\nOffice of the CFO, has transformed critical financial processes for over 800+\nleading companies worldwide.Trusted by prestigious organizations like 3M,\nUnilever, Anheuser-Busch InBev, Sanofi, Kellogg Company, Danone, Hershey's, and\nmany others, HighRadius optimizes order-to-cash, treasury, and record-to-report\nprocesses, earning us back-to-back recognition in Gartner's Magic Quadrant and a\nprestigious spot in Forbes Cloud 100 List for three consecutive years.\n\nWith a remarkable valuation of $3.1B and an impressive annual recurring revenue\nexceeding $100M, we experience a robust year-over-year growth of 24%. With a\nglobal presence spanning 8+ locations and a recent addition in Poland, we're in\nthe pre-IPO stage, poised for rapid growth. We invite passionate and diverse\nindividuals to join us on this exciting path to becoming a publicly traded\ncompany and shape our promising future.\n\nJob Summary:\n\nDevelopment of user stories by following Technical specifications. In this role\nyou will be working closely with Architect and Director.\n\nKey Responsibilities:\n\n * Full stack development including backend SQL, Business layer and UI screens\n * Code reviews to make sure quality code is delivered.\n\nSkill & Experience Needed:\n\n * Strong knowledge in Programming Fundamentals\n * More than 4 years of experience with working on Frontend frameworks like\n   React, Angular, Typescript or similar\n * Experience in working with frameworks such as Flask (Python), Spring MVC,\n   Spring Boot (Java)\n * Database/Storage systems : MySQL, AWS S3, Snowflake etc.\n * Good understanding of data models such as JSON\n * Good understanding of Restful microservices\n * Basic understanding of analytics frameworks.\n * Usage of development tools GIT, JIRA etc.\n * Good Communication\n\nWhat You’ll Get\n\n * Competitive salary.\n * Fun-filled work culture (https://www.highradius.com/culture/)\n * Equal employment opportunities.\n * Opportunity to build with a pre-IPO Global SaaS Centaur.",
  "requirements": [],
  "postedAt": "2025-01-25T20:09:43.541Z",
  "type": "full-time",
  "remote": false
}