{
  "title": "React Native / ReactJS Engineer at Madwire Fort Collins, CO",
  "url": "http://katherinedance.com/jobs/job/react-native-reactjs-engineer-at-madwire-fort-collins-co-TmYrSzJmdWxPSW1VUGFOU24vY0FmMEhIS3c9PQ==",
  "company": "Unknown Company",
  "location": "Fort Collins, CO, ",
  "description": "React Native / ReactJS Engineer job at Madwire. Fort Collins, CO.\n\n\nJOB DESCRIPTION\n\nJob Description\n\n\n\nAbout This Position\n\nWe are looking for an exceptional Frontend Typescript / JavaScript developer\nequally proficient in React Native and ReacttJS. Your primary focus will be on\ndeveloping and implementing user interface components, following well-known\nReact workflows. You will ensure that these components and the overall\napplications are robust, scalable, and easy to maintain. You will coordinate\nwith the rest of our team working on different layers of the infrastructure. A\ncommitment to collaborative problem solving, intelligent design, and quality\nproduct is important.\n\nOur offices are located in Fort Collins, CO. This position can be in-office,\nremote* (in approved states), or a hybrid of the two.\n\n\nWho You Are\n\n * You are an expert troubleshooter and powerful builder.\n * You have an eye for design and excellent attention to detail, prioritizing\n   efficient, enjoyable user experiences.\n\n * You are motivated to get the job done, and done well. Execution Excellence is\n   our standard and our standard is non-negotiable.\n * You are a passionate human: passionate about making a difference in the\n   world, passionate about helping teammates succeed.\n * You are thorough in your work.\n * You embrace curiosity and are ready to learn. Like the clients we represent,\n   our teammates are entrepreneurs. The most successful people at Madwire are\n   those willing to put in the time it takes to become an expert for small\n   business digital marketing.\n * You comfortably navigate between tasks, willing to learn and also teach\n   others.\n\nWhat You’ll Do\n\n * Help build and maintain Marketing 360, the #1 marketing platform.\n * Work with the team, designing and developing new user-facing features for\n   mobile and web in React Native and ReactJS\n * Translating designs and wireframes into high-quality code, forming intuitive\n   user interfaces.\n\n\n\nRequirements\n\n * Strong proficiency in JavaScript, Typescript, React Native, ReactJS, CSS, and\n   semantic HTML.\n * Thorough, demonstrable understanding of React Native and ReactJS, their core\n   principles, and common workflows.\n * Experience in developing, building and releasing React Native apps for both\n   IOS and Android platforms and their nuances.\n * Experience with React Hooks, such as useState, useEffect, and useReducer\n * Experience interacting with RESTful APIs.\n * Familiarity with newer specifications of ECMAScript.\n * Familiarity with Github and Git.\n * Excellent communication skills\n\nBonus Knowledge\n\n * Experience with Expo\n * Server side rendering with React.\n * Frontend testing framework(s) (Jest/Mocha).\n * I18next, the internationalization -framework for JavaScript.\n * Experience with charting and graphs in React\n * Animation libraries for React.\n\n\n\nBenefits\n\nSalary Range\n\n$100,000 - $140,000 annual, depending on experience\n\n\nFlexible Work Location\n\nAs mentioned in the job description, this position can be in office, hybrid or\ncompletely remote within a US approved state*\n\n\n\nEmployee Health Benefits\n\nHealthcare coverage is available through UMR. Ancillary coverage options\nprovided by Guardian for dental, vision, life, critical illness, long term\ndisability, and hospital indemnity. Madwire also provides employer paid life and\nshort term disability through Guardian. Eligibility to enter Madwire’s plan is\neffective on your first day of employment.\n\n\n\n401(k)\n\nMadwire offers a 401k plan through Nationwide. Eligibility to enter the plan is\nfirst of the month following 60 days of employment. Madwire will match 50% of\nemployee contributions up to 6% effective after one year of employment.\n\n\n\nPaid Time Off\n\nMadwire’s PTO policy offers unlimited vacation along with 5 sick days, and 10\npaid holidays per year. Eligibility to participate in this policy is effective\nwith your first day of employment.\n\n\n\nApproved States*\n\nWe are currently hiring in the following states: AK, AZ, AR, CO (outside of\nDenver county for entry level positions*) , FL, GA, HI, IN, IA, KS, KY, LA, MD,\nMI, MN, MS, MO, MT, NE, NJ, NM, NC, ND, OH, OK, OR, PA, RI, SC, SD, TN, TX, UT,\nVT, VA, WV, WI, WY. Please note that it may take up to 2 months to authorize\nwork in some states. Please let the hiring manager know what state you live in\nso we can plan accordingly.\n\nWe Don’t Discriminate\n\nMadwire is an equal opportunity employer and complies with all applicable\nfederal, state and local fair employment practice laws. Madwire strictly\nprohibits and does not tolerate discrimination against employees, applicants or\nany other covered persons because of race, color, religion, creed, national\norigin or ancestry, ethnicity, sex, gender (including gender nonconformity and\nstatus as a transgender or transsexual individual), age, physical or mental\ndisability, citizenship, past, current or prospective service in the uniformed\nservices, genetic information, or any other characteristic protected under\napplicable federal, state or local law. All Madwire employees, other workers and\nrepresentatives are prohibited from engaging in unlawful discrimination. This\npolicy applies to all terms and conditions of employment, including, but not\nlimited to, hiring, training, promotion, discipline, compensation, benefits and\ntermination of employment.\n\nMadwire complies with the Americans with Disabilities Act (ADA), as amended by\nthe ADA Amendments Act, and all applicable state or local law. Consistent with\nthose requirements, Madwire will reasonably accommodate qualified individuals\nwith a disability, if such accommodation would allow the individual to perform\nthe essential functions of the job, unless doing so would create an undue\nhardship.\n\nOther Duties\n\nPlease note this job description is not designed to cover or contain a\ncomprehensive listing of activities, duties or responsibilities that are\nrequired of the employee for this job. Duties, responsibilities, and activities\nmay change at any time with or without notice.",
  "requirements": [],
  "postedAt": "2024-05-22T00:03:08.447Z",
  "type": "full-time",
  "remote": false
}