{
  "title": "UI ReactJS Developer",
  "url": "https://www.iitjobs.com/job/ui-reactjs-developer-san-leandro-ca-united-software-group-inc-35444",
  "company": "Unknown Company",
  "location": "San Leandro, CA,, ",
  "description": "In this role, you will:\n• May require to works on multiple applications.\n• Provides informal mentoring to less experienced colleagues.\n• Develops innovative and creative output based on interpretation and analysis.\n• Participates and may lead critical projects, customer engagements or business\nprocesses.\n• Provides design and documentation at an application or function capability\nlevel.\n• Participates in establishing and maintaining application standards and\nprocesses.\n• Effectively communicates application and technical direction to the business\nand within the customer's IT organization.\n• Advises on issues of systems integration, compatibility, scalability, and\nmultiple platforms.\n• Lead moderately complex initiatives and deliverables within technical domain\nenvironments.\n• Contribute to large scale planning of strategies.\n• Design, code, test, debug, and document for projects and programs associated\nwith technology domain, including upgrades and deployments.\n• Review moderately complex technical challenges that require an in-depth\nevaluation of technologies and procedures.\n• Resolve moderately complex issues and lead a team to meet existing client\nneeds or potential new client needs while leveraging solid understanding of the\nfunction, policies, procedures, or compliance requirements.\n• Works with Product, Interaction and Visual Designers to implement the next\ngeneration User Interface platform & Applications.\n• Collaborate and consult with peers, colleagues, and mid-level managers to\nresolve technical challenges and achieve goals.\n• Lead projects and act as an escalation point, provide guidance and direction\nto less experienced staff.\n• Strong verbal and written communication skills Good analytical skills\n\nRequired Qualifications:\n• 5+ years of Software Engineering experience,\n\nDesired Qualifications:\n• 4+ years of experience with modern HTML, CSS, JavaScript (ES6+), Typescript\nand writing clean, high-quality and developer friendly code.\n• 4+ years of Web Development with any modern JavaScript Web frameworks such as\nReact JS or similar.\n\n• Experience with creating near pixel perfect, robust and developer friendly\ncode for user interfaces / Web Applications.\n• Experience with ReactJS, JestJS, React Testing Library (RTL), Webpack,\nStorybookJS, StencilJS\n• Experience build RESTFul API and web services.\n• Experience with creating large scale Web Applications, specifically with\nReactJS.\n• Familiarity with complex state management, specifically with other state\nmanagement tools like Redux, RxJS or other similar.\n• Experience writing and UI unit tests (Jest, Jasmine, etc.)\n• Experience or strong knowledge in BDD/Automated testing and Accessibility /\nADA\n• Experience with guidance and mentoring of other developers while working on\nprojects and initiatives.\n• Experience with creating high-performance applications.\n• Experience with code hosting platform for version control and collaboration\ntools like GitHub.\n• Experience with Project Tracking software like Jira.\n• Experience in using developer tools for troubleshooting the issues.\n• Experience or having knowledge in monitoring applications like Splunk, etc.\n• Experience or having strong knowledge working with Content Management Systems\n(CMS).\n• Experience or having knowledge in using the Interface Design tool like Figma,\nInvision, etc",
  "requirements": [],
  "postedAt": "2024-05-29T10:05:03.552Z",
  "type": "full-time",
  "remote": false
}