{
  "title": "Senior ReactJS Developer",
  "url": "https://jobs.iqvia.com/en/job/dhaka/senior-reactjs-developer/24443/66656460560",
  "company": "Unknown Company",
  "location": "undefined, undefined",
  "description": "Job Overview\n\nIQVIA is looking for a Senior Software Engineer focusing on microservice\narchitecture, cloud computing and scalability within our SaaS and mobile\nproducts which deliver highly available and scalable data management, analytics\nand AIML capabilities to our largest Pharmaceutical clients.\nDo you have a passion for building great products? Do you believe in\ncustomer-centricity? Do you have strong analytical, interpretative, and\nproblem-solving skills? Do you want to work in a positive, can-do environment\nwhere collaboration and growth mindset are valued? \nJoin us!\n\nKey Technologies:\n\n * React JS\n * MongoDB / Snowflake / Firebolt / PostgreSQL / SQL Server / Neo4j\n * Redis / RabbitMQ / Celery\n * Kubernetes / Docker\n * AWS / Azure\n * .Net\n\n\n\nPrinciple Responsibilities:\n\n * Produce efficient, high quality code that ensures system performance and\n   scalability\n * Contribute to solution architectural decisions\n * Develop REST APIs and microservices using .NET\n * Design and develop data models to support Analytical and ML / AI requirements\n * Undertake integration of 3rd party services\n * Work closely with data scientists and machine learning engineers to develop\n   microservices and pipelines that support algorithm development\n * Conduct code reviews with fellow software engineers\n * Implement unit and integration tests\n * Create and maintain comprehensive documentation\n * Employ version control and CI/CD best practices\n\n\n\nThe ideal candidate will have, at minimum:\n\n * BS in Computer Science (or other quantitative discipline) or 4-7 years\n   relevant experience in software development \n * Strong experience in ReactJS.\n * .NET Identity Server / Duende or similar frameworks using OAuth / OIDC /\n   SAML2.0\n * Experience with database and data processing frameworks like Snowflake,\n   MySQL, MongoDB, Redshift/Postgres\n * Experience with SQL, Data modelling and database structures\n * Experience with analysis and optimization of data models for analytical\n   purposes\n * Experience building REST APIs\n * Strong object-oriented design and programming skills\n * Experience with testing frameworks\n * Experience with version control and working in a Linux environment\n * A passion for creative problem solving\n * Experience distilling and presenting complex concepts to a non-technical\n   audience\n * Excellent communication (written and oral) and interpersonal skills\n\n\n\nWe also value any of the following:\n\n * Background in statistics, data science, and machine learning techniques\n * Understanding of CI/CD pipelines and experience working with Gitlab\n * Experience with graph databases and GraphQL\n * Experience with Test Driven Development\n * Experience with DevOps processes and tools\n * Experience working with monitoring / telemetry toolkits such as Grafana /\n   Jaeger / ELK is beneficial\n * Experience implementing complex back-end functionalities and integrations\n   with multiple 3rd party systems and services.\n\n\n\n\n\nIQVIA is a leading global provider of advanced analytics, technology solutions\nand clinical research services to the life sciences industry. We believe in\npushing the boundaries of human science and data science to make the biggest\nimpact possible – to help our customers create a healthier world. Learn more at\nhttps://jobs.iqvia.com [https://jobs.iqvia.com/]",
  "requirements": [],
  "postedAt": "2024-06-21T13:35:05.814Z",
  "type": "full-time",
  "remote": false
}