{
  "title": "Application Engineer ( ReactJS )",
  "company": "Unknown Company",
  "location": "Riverwoods, United States",
  "description": "Discover. A brighter future.\n\nWith us, you’ll do meaningful work from Day 1. Our collaborative culture is\nbuilt on three core behaviors: We Play to Win, We Get Better Every Day & We\nSucceed Together. And we mean it — we want you to grow and make a difference at\none of the world's leading digital banking and payments companies. We value what\nmakes you unique so that you have an opportunity to shine.\n\nCome build your future, while being the reason millions of people find a\nbrighter financial future with Discover.\n\nJob Description\n\nAt Discover, be part of a culture where diversity, teamwork and collaboration\nreign. Join a company that is just as employee-focused as it is on its customers\nand is consistently awarded for both. We’re all about people, and our employees\nare why Discover is a great place to work. Be the reason we help millions of\nconsumers build a brighter financial future and achieve yours along the way with\na rewarding career.\n\nResponsible for oversight on design and implementation of products assigned to\ntheir team. Still needs to think things through but has their driver's license.\nThis means they can take user stories and new features from idea to production\nunattended. Actively manages and escalates risk and customer-impacting issues\nwithin the day-to-day role to management.\n\nResponsibilities\n\n\n * Analyze, design, program, test, and deploy new user stories and features with\n   high quality (security, reliability, operations) to production\n * Tends to Associate Application Engineers by providing learning tasks as well\n   as work related tasks, directs the work of Senior Associate Application\n   Engineers, and helps them continue to grow\n * Achieves team commitments (and influence others to do the same) by using\n   informal leadership & highly developed communication skills\n * Has an oversight on design decisions and guides team to achieve key results\n   for products assigned to them\n * Remediates issues using engineering principles and creates proactive design\n   solutions for potential failures\n * Contributes to and leads technology communities at Discover\n   \n   \n\nMinimum Qualifications\n\nAt a minimum, here’s what we need from you:\n\n\n * Bachelors – Computer Science, Engineering, Informatics, Information Security,\n   Information Technology or related\n * 3+ Years – Information Technology, (Software) Engineering, or related\n   \n   \n\nInternal applicants only: technical proficiency rating of competent on the\nDreyfus engineering scale\n\nPreferred Qualifications\n\nBonus Points If You Have:\n\n\n * Front end design and development and maintenance using React JS,\n   \n   \n\nAutomated testing frameworks focusing on UI\n\nEngineering experience with Java on Spring Boot\n\n\n * Design and redesign of API's, Microservices, applications and systems.\n * Deployment of applications to the cloud\n * Testing, CI/CD, Release Management\n * Excellent documentations skills.\n * Experience working in an Agile Environment\n   \n   \n\nExternal applicants will be required to perform a technical interview.\n\nWhat are you waiting for? Apply today\n\nAnd by the way, while you're waiting to hear from us, don't forget to check out\nthe great benefits Discover offers.\n\nAll Discover employees place our customers at the very center of our work. To\ndeliver on our promises to our customers, each of us contribute every day to a\nculture that values compliance and risk management.\n\nThe same way we treat our employees is how we treat all applicants – with\nrespect. Discover Financial Services is an equal opportunity employer (EEO is\nthe law). We thrive on diversity & inclusion. You will be treated fairly\nthroughout our recruiting process and without regard to race, color, religion,\nsex, sexual orientation, gender identity, national origin, disability, veteran\nstatus or any other characteristic protected by federal, state, or local law in\nconsideration for a career at Discover.\n\nApplication Deadline\n\nThe application window for this position is anticipated to close on Jun-23-2024.\nWe encourage you to apply as soon as possible. The posting may be available past\nthis date, but it is not guaranteed.\n\nCompensation\n\nThe base pay for this position generally ranges between $86,500.00 to\n$146,100.00. Additional incentives may be provided as part of a market\ncompetitive total compensation package. Factors, such as but not limited to,\ngeographical location, relevant experience, education, and skill level may\nimpact the pay for this position.\n\nBenefits\n\nWe also offer a range of benefits and programs based on eligibility. These\nbenefits include:\n\n\n * Paid Parental Leave\n * Paid Time Off\n * 401(k) Plan\n * Medical, Dental, Vision, & Health Savings Account\n * STD, Life, LTD and AD&D\n * Recognition Program\n * Education Assistance\n * Commuter Benefits\n * Family Support Programs\n * Employee Stock Purchase Plan\n   \n   \n\nLearn more at mydiscoverbenefits.com.\n\nWhat are you waiting for? Apply today!\n\nAll Discover employees place our customers at the very center of our work. To\ndeliver on our promises to our customers, each of us contribute every day to a\nculture that values compliance and risk management.\n\nDiscover is committed to a diverse and inclusive workplace. Discover is an equal\nopportunity employer and does not discriminate on the basis of race, color,\nreligion, sex, sexual orientation, gender identity, national origin, age,\ndisability, protected veteran status, or other legally protected status. (Know\nYour Rights & Pay Transparency Nondiscrimination Provision)\n\nDiscover complies with federal, state, and local laws applicable to qualified\nindividuals with disabilities and is committed to providing reasonable\naccommodations. If you require a reasonable accommodation to search for a\nposition, to complete an application, and/or to participate in an interview,\nplease email HireAccommodation@discover.com. Any information you provide\nregarding your accommodation needs will be kept confidential and will only be\nused to determine and provide necessary accommodation.",
  "requirements": [],
  "postedAt": "2025-01-25T20:09:43.547Z",
  "type": "full-time",
  "remote": false
}