{
  "title": "ReactJS Developer - Remote",
  "company": "Unknown Company",
  "location": "Bangalore, India",
  "description": "Role Overview:\n\nWe are seeking a UI ReactJS development engineer to join the McAfee Consumer Platform Product Development team. In this role, you will be responsible for designing, developing, and maintaining the various projects handled by our development team. The ideal candidate should thrive in a dynamic, fast-paced environment and possess the ability to deliver solutions to meet the development requirements of multiple projects.\n\nThis is a remote position in India. We will only consider candidates currently in India and are not offering relocation assistance at this time.\n\nAbout the role:\n\n\nWork collaboratively with product managers, architects, and colleagues to design cloud solutions that are scalable, performant, and cost optimized.\nPerform Failure Mode and Effects Analysis (FMEA), implement preventive measures against potential failures, and establish monitoring and alerting systems.\nEvaluate technical feasibility through the creation of rapid proofs of concepts (PoCs) and experimentation with new and relevant technologies and tools.\nActively participate in an Agile Scrum environment, contributing to the development of e-commerce applications and services.\nAdapt to the sprint requirements by being proficient in various roles, including design, development, testing, and deployment.\n\n\nAbout You:\n\n\n4 to 5 years of extensive experience in designing and developing UI solutions.\nProficient in UI development using React.JS, JavaScript, ES6, TypeScript, HTML5, CSS3, and other design frameworks.\nGood to have knowledge of EKS, Dockers, Kubernetes, containers, etc.\nYou should have a knack for software monitoring tools like Grafana, Instana, etc.\nProven track record of developing, deploying, debugging, and scaling applications utilizing Amazon Web Services (AWS).\nGood to have knowledge of the Node.JS framework.\n\n\n#LI-Remote\n\nCompany Overview\n\nMcAfee is a leader in personal security for consumers. Focused on protecting people, not just devices, McAfee consumer solutions adapt to users’ needs in an always online world, empowering them to live securely through integrated, intuitive solutions that protects their families and communities with the right security at the right moment.\n\nCompany Benefits and Perks:\n\nWe work hard to embrace diversity and inclusion and encourage everyone at McAfee to bring their authentic selves to work every day. We offer a variety of social programs, flexible work hours and family-friendly benefits to all of our employees.\n\n\nBonus Program\nPension and Retirement Plans\nMedical, Dental and Vision Coverage\nPaid Time Off\nPaid Parental Leave\nSupport for Community Involvement\n\n\nWe're serious about our commitment to diversity which is why McAfee prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status.",
  "requirements": [],
  "postedAt": "2025-01-25T20:09:43.546Z",
  "type": "full-time",
  "remote": false
}