{
  "title": "UI ReactJs Developer",
  "company": "Unknown Company",
  "location": "undefined, ",
  "description": "**Job Family:** Research & Development\n\n**Req ID:** 427176\n\nHello Visionary!\n\nWe empower our people to stay resilient and relevant in a constantly evolving\nworld. We’re looking for people who are always searching for creative ways to\ngrow and learn. People who want to make a real impact, now and in the future.\n\nDoes that sound like you? Then it seems like you’d make a great addition to our\nvibrant team.\n\nWe are looking for **ReactJs UI Developer** .\n\nBefore our software developers write even a single line of code, they have to\nunderstand what drives our customers. What is the environment? What is the user\nstory based on? Implementation means – trying, testing, and improving outcomes\nuntil a final solution emerges. Knowledge means exchange – discussions with\ncolleagues from all over the world.\n\nJoin our Digitalization Technology and Services (DTS) team based in Bangalore.\n\n**You’ll make a difference by:**\n\nBeing responsible for the development and delivery of parts of a product, in\naccordance to the customers’ requirements and organizational quality norms.\nActivities to be performed include:\n\n• Implementation of features and/or bug-fixing and delivering solutions in\naccordance with coding guidelines and on-time with high quality.\n\n• Identification and implementation of unit and integration tests to ensure\nsolution addresses customer requirements, and quality, security requirements of\nproduct are met.\n\n• Performing code review and creation / support for relevant documentation\n(requirement/design/test specification).\n\n• Ensuring integration and submission of solution into software configuration\nmanagement system, within committed delivery timelines.\n\nPerforming regular technical coordination / review with stake holders and\nensuring timely reporting and escalations if any.\n\n**Job Requirements/ Skills:**\n\n• 3-5 years’ work experience in Software Engineering especially in professional\nsoftware product development.\n\n• Experience in expert functions like Software Development, Software Testing\n\n• Experience in ReactJs, Angular 6+, JavaScript, TypeScript, jQuery, OOPS\nconcept, HTML, CSS\n\n• Knowledge of other frameworks like React, Node, Hybrid Mobile Technologies\nwould be added advantage\n\n• Experience with Unit Testing framework for UI+ Service development\n\n• Experience in Cloud Technology is a plus\n\n• Experience with Responsive Web design is a plus\n\n• Experience with AG-Grid and Bootstrap would be preferred\n\n• Good knowledge of cross platform rendering issues between major browsers and\nplatforms is a plus\n\n• Must have good analytical, debugging ad tracing skills. Should be well-versed\nwith clean code principles (DRY, KISS). Exposure to secure coding is beneficial.\n\n**Join us and be yourself!**\n\nWe value your unique identity and perspective and are fully committed to\nproviding equitable opportunities and building a workplace that reflects the\ndiversity of society. Come bring your authentic self and create a better\ntomorrow with us.\n\nProtecting the environment, conserving our natural resources, fostering the\nhealth and performance of our people as well as safeguarding their working\nconditions are core to our social and business commitment at Siemens. They are\nan integral part of our Business Conduct Guidelines and our corporate strategy.\n\n**Make your mark in our exciting world at Siemens.**\n\nThis role is in Bangalore, where you’ll get the chance to work with teams\nimpacting entire cities, countries – and the craft of things to come.\n\nWe’re Siemens. A collection of over 379,000 minds building the future, one day\nat a time in over 200 countries. We’re dedicated to equality, and we encourage\napplications that reflect the diversity of the communities we work in. All\nemployment decisions at Siemens are based on qualifications, merit and business\nneed. Bring your curiosity and creativity and help us craft tomorrow.\n\nAt Siemens we are always challenging ourselves to build a better future. We need\nthe most innovative and diverse Digital Minds to develop tomorrow ‘s reality.\nFind out more about the Digital world of Siemens here:\nwww.siemens.com/careers/digitalminds\n\nFind out more about siemens advanta at: https://www.siemens-advanta.com/careers\n\nShare on LinkedIn\n[https://www.meddevicejobs.com/wp-content/plugins/simple-share-buttons-adder/buttons/somacro/linkedin.png]http://www.linkedin.com/shareArticle?mini=true&url=https://www.meddevicejobs.com/jobs/ui-reactjs-developer-in-bengaluru-karnataka-in/Share\non Facebook\n[https://www.meddevicejobs.com/wp-content/plugins/simple-share-buttons-adder/buttons/somacro/facebook.png]http://www.facebook.com/sharer.php?u=https://www.meddevicejobs.com/jobs/ui-reactjs-developer-in-bengaluru-karnataka-in/Share\non Google+\n[https://www.meddevicejobs.com/wp-content/plugins/simple-share-buttons-adder/buttons/somacro/google.png]https://plus.google.com/share?url=https://www.meddevicejobs.com/jobs/ui-reactjs-developer-in-bengaluru-karnataka-in/Pin\non Pinterest\n[https://www.meddevicejobs.com/wp-content/plugins/simple-share-buttons-adder/buttons/somacro/pinterest.png]javascript:void((function()%7Bvar%20e=document.createElement(Email\nthis to someone\n[https://www.meddevicejobs.com/wp-content/plugins/simple-share-buttons-adder/buttons/somacro/email.png]?subject=UI\nReactJs\nDeveloper&body=%20https://www.meddevicejobs.com/jobs/ui-reactjs-developer-in-bengaluru-karnataka-in/",
  "requirements": [],
  "postedAt": "2025-01-25T20:09:43.546Z",
  "type": "full-time",
  "remote": false
}