{
  "title": "UI ReactJs Developer",
  "website_url": "https://usasiemens.dejobs.org/el-paso-tx/shipping-and-receiving-administrative-assistant/689F3440721F4606B1121281590F1BD5/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
  "url": "http://usasiemens.dejobs.org/bangalore-ind/ui-reactjs-developer/DDD52E57C94440A480C4BF03CCA062C9/job",
  "company": "Unknown Company",
  "location": "Bangalore, India",
  "description": "Job Family:   Research & Development\n\nReq ID:   427176\n\nHello Visionary!\n\nWe empower our people to stay resilient and relevant in a constantly evolving world. We’re looking for people who are always searching for creative ways to grow and learn. People who want to make a real impact, now and in the future.\n\nDoes that sound like you? Then it seems like you’d make a great addition to our vibrant team.\n\nWe are looking for  ReactJs UI Developer .\n\nBefore our software developers write even a single line of code, they have to understand what drives our customers. What is the environment? What is the user story based on? Implementation means – trying, testing, and improving outcomes until a final solution emerges. Knowledge means exchange – discussions with colleagues from all over the world.\n\nJoin our Digitalization Technology and Services (DTS) team based in Bangalore.\n\nYou’ll make a difference by:\n\nBeing responsible for the development and delivery of parts of a product, in accordance to the customers’ requirements and organizational quality norms. Activities to be performed include:\n\n• Implementation of features and/or bug-fixing and delivering solutions in accordance with coding guidelines and on-time with high quality.\n\n• Identification and implementation of unit and integration tests to ensure solution addresses customer requirements, and quality, security requirements of product are met.\n\n• Performing code review and creation / support for relevant documentation (requirement/design/test specification).\n\n• Ensuring integration and submission of solution into software configuration management system, within committed delivery timelines.\n\nPerforming regular technical coordination / review with stake holders and ensuring timely reporting and escalations if any.\n\nJob Requirements/ Skills:\n\n• 3-5 years’ work experience in Software Engineering especially in professional software product development.\n\n• Experience in expert functions like Software Development, Software Testing\n\n• Experience in ReactJs, Angular 6+, JavaScript, TypeScript, jQuery, OOPS concept, HTML, CSS\n\n• Knowledge of other frameworks like React, Node, Hybrid Mobile Technologies would be added advantage\n\n• Experience with Unit Testing framework for UI+ Service development\n\n• Experience in Cloud Technology is a plus\n\n• Experience with Responsive Web design is a plus\n\n• Experience with AG-Grid and Bootstrap would be preferred\n\n• Good knowledge of cross platform rendering issues between major browsers and platforms is a plus\n\n• Must have good analytical, debugging ad tracing skills. Should be well-versed with clean code principles (DRY, KISS). Exposure to secure coding is beneficial.\n\nJoin us and be yourself!\n\nWe value your unique identity and perspective and are fully committed to providing equitable opportunities and building a workplace that reflects the diversity of society. Come bring your authentic self and create a better tomorrow with us.\n\nProtecting the environment, conserving our natural resources, fostering the health and performance of our people as well as safeguarding their working conditions are core to our social and business commitment at Siemens. They are an integral part of our Business Conduct Guidelines and our corporate strategy.\n\nMake your mark in our exciting world at Siemens.\n\nThis role is in Bangalore, where you’ll get the chance to work with teams impacting entire cities, countries – and the craft of things to come.\n\nWe’re Siemens. A collection of over 379,000 minds building the future, one day at a time in over 200 countries. We're dedicated to equality, and we encourage applications that reflect the diversity of the communities we work in. All employment decisions at Siemens are based on qualifications, merit and business need. Bring your curiosity and creativity and help us craft tomorrow.\n\nAt Siemens we are always challenging ourselves to build a better future. We need the most innovative and diverse Digital Minds to develop tomorrow ‘s reality. Find out more about the Digital world of Siemens here: www.siemens.com/careers/digitalminds\n\nFind out more about siemens advanta at: https://www.siemens-advanta.com/careers",
  "requirements": [],
  "postedAt": "2024-07-16T19:21:27.845Z",
  "type": "full-time",
  "remote": false
}