{
  "title": "reactJS Developer",
  "website_url": "https://careers-inc.nttdata.com/job/Nashville-Entry-Level-Business-and-Technology-Strategy-Consultant-TN-37201/1069557900/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
  "url": "https://careers-inc.nttdata.com/job/Pune-reactJS-Developer-MH/1206633500",
  "company": "Unknown Company",
  "location": "Pune, ",
  "description": "Req ID: 292815 \r\n\r\nNTT DATA Services strives to hire exceptional, innovative and passionate individuals who want to grow with us. If you want to be part of an inclusive, adaptable, and forward-thinking organization, apply now.\r\n\r\nWe are currently seeking a reactJS Developer to join our team in Pune, Mahārāshtra (IN-MH), India (IN).\r\nOnce You Are Here, You Will:\r\n\r\n\r\n\tWork with architect to gather the technical details and requirements.\r\n\tDevelop modules end to end using React Native.\r\n\tWrite unit test cases and execute the test cases against the entire application functionalities.\r\n\tWork with backend team for REST service creation.\r\n\tIntegrate REST services in the application.\r\n\tIntegrate third-party authentication services.\r\n\tFollow UI design, UI guidelines and coding guidelines to develop and deliver the applications.\r\n\tParticipate in code review process and implementing the code review comments.\r\n\tEnsure applications are working across many platforms like IOS and Android.\r\n\tFix any mobile application issues or bugs that arise.\r\n\r\n\r\n \r\n\r\nBasic Qualifications:\r\n\r\n\r\n\t5+ Years’ experience in frontend development.\r\n\t3+ Years’ experience as a React Native development.\r\n\t1+ Years’ experience with Java script frameworks like Angular, Ionic, ReactJS and Flutter.\r\n\t1+ Years’ experience in React Native, HTML5, CSS3 mobile application development.\r\n\t1+ Years’ experience of REACT tools including Webpack, Enzyme, Redux, and Flux.\r\n\tBachelor’s Degree or equivalent combined 4 years education and work experience.\r\n\tAble to travel as needed for project assignments (25%-50%) after pandemic when travel returns to normal.\r\n\r\n\r\n \r\n\r\nPreferred:\r\n\r\n\r\n\t2+ years’ Experience of collaborate with the team members and mentoring the junior team members in a distributed structure.\r\n\t2+ years’ Experience with SVN, Git, Gradle version control experience, Bitbucket.\r\n\t2+ years’ Experience Tracking/Updating progress of code development using process management tools like Atlassian JIRA.\r\n\t1+ years’ Experience in uploading applications to Google Play store & Apple app store.\r\n\t1+ years’ Experience with working in Agile and DevOps model.\r\n\t1+ years’ Experience with unit & integration Testing and CI/CD.\r\n\r\n\r\n \r\n\r\nIdeal Mindset:\r\n\r\n\r\n\tLifelong Learner. You are always seeking to improve your technical and nontechnical skills.\r\n\tTeam Player. You are someone who wants to see everyone on the team succeed and is willing to go the extra mile to help a teammate in need.\r\n\tListener. You listen to the needs of the customer and make those the priority throughout development.\r\n\r\n\r\n \r\n\r\nLocation:\r\n\r\n \r\n\r\nApplications should include a resume.\r\n\r\n \r\n\r\n \r\n\r\n#LaunchJobs #LaunchEngineering\r\n\r\nAbout NTT DATA\r\n\r\nNTT DATA is a $30+ billion trusted global innovator of business and technology services. We serve 75% of the Fortune Global 100 and are committed to helping clients innovate, optimize and transform for long term success. We invest over $3.6 billion each year in R&D to help organizations and society move confidently and sustainably into the digital future. As a Global Top Employer, we have diverse experts in more than 50 countries and a robust partner ecosystem of established and start-up companies. Our services include business and technology consulting, data and artificial intelligence, industry solutions, as well as the development, implementation and management of applications, infrastructure, and connectivity. We are also one of the leading providers of digital and AI infrastructure, and connectivity. We are also one of the leading providers of digital and AI infrastructure in the world. NTT DATA is part of NTT Group and headquartered in Tokyo. Visit us at nttdata.com\r\n\r\nNTT DATA Services is an equal opportunity employer and considers all applicants without regarding to race, color, religion, citizenship, national origin, ancestry, age, sex, sexual orientation, gender identity, genetic information, physical or mental disability, veteran or marital status, or any other characteristic protected by law. We are committed to creating a diverse and inclusive environment for all employees. If you need assistance or an accommodation due to a disability, please inform your recruiter so that we may connect you with the appropriate team.\r\n\r\n#LI-INCDL\r\n\r\n \r\n\r\n \r\nAbout NTT DATA\r\n\r\nNTT DATA is a $30+ billion trusted global innovator of business and technology services. We serve 75% of the Fortune Global 100 and are committed to helping clients innovate, optimize and transform for long-term success. As a Global Top Employer, we have diverse experts in more than 50 countries and a robust partner ecosystem of established and start-up companies. Our services include business and technology consulting, data and artificial intelligence, industry solutions, as well as the development, implementation and management of applications, infrastructure and connectivity. We are also one of the leading providers of digital and AI infrastructure in the world. NTT DATA is part of NTT Group, which invests over $3.6 billion each year in R&D to help organizations and society move confidently and sustainably into the digital future. Visit us at us.nttdata.com.",
  "requirements": [],
  "postedAt": "2024-09-09T22:32:20.295Z",
  "type": "full-time",
  "remote": false
}