{
  "title": "ReactJS Developer",
  "company": "Unknown Company",
  "location": "undefined, ",
  "description": "Infosys is seeking a ReactJS Developer. This position will interface with key\nstakeholders and apply your technical proficiency across different stages of the\nSoftware Development Life Cycle including requirements elicitation, application\narchitecture definition and design. You will play an important role in creating\nthe high-level design artifacts. You will also deliver high quality code\ndeliverables for a module, lead validation for all types of testing and support\nactivities related to implementation, transition and warranty. You will be part\nof a learning culture, where teamwork and collaboration are encouraged,\nexcellence is rewarded, and diversity is respected and valued.\n\nCandidate must be located in Raleigh, NC or be willing to relocate to the state.\nThis position may require travel to project locations.\n\nU.S. citizens and Green Card Holders are encouraged to apply. We are unable to\nsponsor at this time.\n\nQualifications\nBasic\n• Bachelor's degree or foreign equivalent required from an accredited\ninstitution. Will also consider three years of progressive experience in the\nspecialty in lieu of every year of education.\n• At least 2 years of experience in Information Technology\n• At least 2 years of experience with UI (HTML, CSS and Javascript , Angular)\nand Java/ J2EE technologies.\n\nRequired\n\n * At least 2 years of experience in Design and architecture review.\n * At least 2 years of experience in software development life cycle with good\n   experience in Agile Development Model.\n * Deep knowledge of React JS, Redux practices and commonly used modules based\n   on extensive work experience.\n * Working knowledge of Elastic JS and Next JS\n * Good Experience in Java\n * Creating self-contained, reusable, and testable modules and components\n * Ensuring a clear dependency chain, in regard to the app logic as well as the\n   file system\n * Experience with 3rd party libraries for DOM manipulation, understanding\n   JavaScript event model.\n * Understands how to write efficient selectors\n * Understands CSS rule specificity\n * Ability to work in team environment and client interfacing skills.\n * Analytical skills\n * Experience and desire to work in a Global delivery environment\n\nThe job entails sitting as well as working at a computer for extended periods of\ntime. Should be able to communicate by telephone, email or face to face. Travel\nmay be required as per the job requirements.",
  "requirements": [],
  "postedAt": "2025-01-25T20:09:43.542Z",
  "type": "full-time",
  "remote": false
}