{
  "title": "reactjs engineer",
  "website_url": "https://randstadusa.dejobs.org/phoenix-az/senior-account-manager-financial-services/D4683F2530764DE39B296E1C48B56DA0/job/?utm_source=.JOBS+RSS+Feed-DE&utm_campaign=.JOBS+RSS+Feed&utm_medium=.JOBS+Universe&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
  "url": "https://randstadusa.dejobs.org/beaverton-or/reactjs-engineer/01DFCEEAC3904DB88581CF64DFA1C4BD/job",
  "company": "Unknown Company",
  "location": "beaverton, United States",
  "description": "reactjs engineer.\n\n\nbeaverton , oregon\nposted 6 days ago\n\n\njob details\n\nsummary\n\n\n$50 - $66.60 per hour\ncontract\nbachelor degree\n\ncategory computer and mathematical occupations\nreference1065636\n\n\njob details\n\njob summary:\n\nWHAT YOU WILL WORK ON\n\nYou'll be working with members of the Legal & Contracts Engineering team to deliver a premium user experience integrated with legal data platform enriched with our AI capabilities to enhance the way we do business. You will translate design documents into pixel perfect views and develop ReactJS components that serve the technical and non-technical stakeholder requirements, adhering to enterprise standards and seamlessly integrating with the broader  ecosystem. Core accountabilities of this job include:\n\n\nParticipating in architectural design sessions with the team's engineers\nConvert business requirements into reusable ReactJS components\nTranslate design specifications to pixel perfect views using ReactJS, Typescript and SCSS\nImplement accessibility features according to  ADA standards\nImplement deployment pipelines using  CI/CD (Jenkins and Github Actions) for static website hosting\nAssist in the task breakdown to convert designs into development tasks\nParticipate in engineer code reviews via GitHub\nMentor junior engineers through co-development practices such as pair programming\n\n\nWHO YOU WILL WORK WITH\n\nYou will work closely with business stakeholders, product owners, leadership, and your peers within the engineering team to ensure the successful delivery of the software. Additionally, you will work with other technology teams that lead the up and down stream solutions to coordinate dependencies.\n\nWHAT YOU BRING\n\nTo make it clear, we're not looking for just anyone. We're looking for someone special, someone who had these experiences and clearly demonstrated these skills:\n\n\nBachelor degree in Computer Science, Information Systems, Engineering, or related field or equivalent combination of education and experience\n5+ years using design specifications to develop views using HTML/HTML5 and CSS/SCSS/SASS\nExperience with common front-end development tools such as Yarn, NPM, Node, etc.\nFamiliarity with popular Global State management packages for such as Redux, Flux and React Context\nExperience with various build tools and website hosting patterns\nExperience integrating websites with various REST APIs\nExperience with common front-end development tools such as Babel, Webpack, NPM, etc.\nFamiliarity with popular ReactJS workflows (Flux, Redux)\nFamiliarity with newer specifications of EcmaScript\nExperience working with business stakeholders and product managers to drive requirements and delivery\nExperience in an Agile or Scrum development environment, including a demonstrated ability to deliver software applications in this environment\nProven ability to deliver highly integrated software applications with complex dependencies\nProven experience as a member of a large project / project team\nOutstanding collaboration, listening, written and verbal communication skills\nHigh tolerance for ambiguity and changing priorities\n\n\nlocation: BEAVERTON, Oregon\n\njob type: Contract\n\nsalary: $50.00 - 66.60 per hour\n\nwork hours: 8am to 4pm\n\neducation: Bachelors\n\nresponsibilities:\n\nWHAT YOU WILL WORK ON\n\nYou'll be working with members of the Legal & Contracts Engineering team to deliver a premium user experience integrated with legal data platform enriched with our AI capabilities to enhance the way we do business. You will translate design documents into pixel perfect views and develop ReactJS components that serve the technical and non-technical stakeholder requirements, adhering to enterprise standards and seamlessly integrating with the broader  ecosystem. Core accountabilities of this job include:\n\n\nParticipating in architectural design sessions with the team's engineers\nConvert business requirements into reusable ReactJS components\nTranslate design specifications to pixel perfect views using ReactJS, Typescript and SCSS\nImplement accessibility features according to  ADA standards\nImplement deployment pipelines using  CI/CD (Jenkins and Github Actions) for static website hosting\nAssist in the task breakdown to convert designs into development tasks\nParticipate in engineer code reviews via GitHub\nMentor junior engineers through co-development practices such as pair programming\n\n\nqualifications:\n\n\nExperience level: Experienced\nMinimum 5 years of experience\nEducation: Bachelors\n\n\nskills:\n\n\nHTML (5 years of experience is preferred)\nRESTful APIs\nReactEqual Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.At Randstad Digital, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.Pay offered to a successful candidate will be based on several factors including the candidate's education, work experience, work location, specific job duties, certifications, etc.  In addition, Randstad Digital offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).This posting is open for thirty (30) days.",
  "requirements": [],
  "postedAt": "2024-09-20T13:24:16.819Z",
  "type": "full-time",
  "remote": false
}