{
  "title": "Senior ReactJS/React Native Software Engineer",
  "company": "Unknown Company",
  "location": "undefined, ",
  "description": "Company Description\n\nStrategic Systems is a solutions company based in Buford, GA, focusing on\nenterprise mobility, RFID, and wireless networking. We’ve channeled our\nextensive RFID technology and mobility experience into creating a scalable,\nflexible cloud-based platform that enables companies to track the movement of\npeople and items within their organization using multiple technologies,\nproviders, and devices.\n\n\n\n\nRole Description\n\nThis is a full-time, remote or hybrid role to join our small, talented\ndevelopment team. We are looking for a smart, experienced software engineer with\ndemonstrable experience in React Native and ReactJS, and, in general, getting\nthings done. You will help us maintain and expand our cloud-based application\nconfiguration platform, and the solutions built on it.\n\n\n\n\nYou will be responsible for enhancing our dynamic React/ReactNative\ncross-platform frontend. You will participate in architectural discussions,\nperform peer code reviews, and help us keep the overall quality high while\nmaintaining a focus on deliverability. For a full list of our development\ntenets, please see our Development Team Principles.\n\n\n\n\nIf this sounds attractive to you, we are looking for a bright, experienced\nprofessional software developer to join our team. Either well experienced in\ngeneral (10+years), and some (3+years) ReactJS and similar experience, or a\nReactJS expert (5+ years in general, most of which with ReactJS/React Native).\n\n\n\n\nQualifications\n\n * 10+ years Software developement + 3+ years React Native / ReactJS, or\n * 5+ years React Native / ReactJS experience on demonstratable complex\n   frontends\n * Strong problem-solving and analytical abilities\n * Excellent communication and teamwork skills\n * Strong proficiency in English\n * Bachelor’s degree in Computer Science or related field\n * Previous experience in enterprise mobility or RFID technologies is a plus\n\n\n\n\nMore Information\n\nWe’ve been in business for more than 20 years. Our habit of hiring capable and\nfriendly people is part of the reason for that success. To join us, you will\nneed to be dedicated to your profession and excited by the work we do.\n\n\n\n\nOnly US-based candidates will be considered for this position, EST or CT time\nzones preferred. Core hours are 9:30 am to 4:00 pm Eastern time. Our office is\nin Suwanee, GA which is just north of Atlanta, but the development team works\nremotely apart from occasional in-person meetings. We will not provide visa\nsponsorship.",
  "requirements": [],
  "postedAt": "2025-01-25T20:09:43.540Z",
  "type": "full-time",
  "remote": false
}