{
  "title": "ReactJS Developer",
  "website_url": "https://app.joinrise.co/jobs/patient-sitter-qrkb?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
  "url": "https://app.joinrise.co/jobs/infovision-inc-reactjs-developer-j931",
  "company": "Unknown Company",
  "location": "N/A, ",
  "description": "ReactJS Developer Location: San Francisco, CAJob Description:We are looking for\nan experienced Front-End Developer with strong background in JavaScript, React,\nRedux and other relevant front-end technologies. You will be responsible for the\ndeveloping user interface for our business portal for internal and external\nusers. Qualified candidates will be expected to have a working knowledge of\nHTML5, CSS, JavaScript, React, and a basic understanding of user interface and\nuser experience (UI/UX) design. Your duties will include turning wireframes and\nmock-ups into reusable code and building high-quality UI components with\nscalability in mind.Responsibilities:Build web applications with web development\nbest practicesTransform app designs into front-end code with HTML, CSS, and\nJavaScript / ReactWork with back-end developers to integrate UI components with\nAPIs and databasesGather and refine specifications and requirements based on\ntechnical requirements or UX designDebug errors, troubleshoot issues, and\nperform routine performance optimizationsWrite high-quality, scalable, and\nreusable code. Write unit tests and functional tests.Technical\nSkills:JavaScript, React, ReduxHTML5, CSS, Tailwind, Headless Components,\nMicro-FrontEndJest, React test libraries, Playwright,Responsive Design skills\nthat support major browser types and mobile devicesAPI integration with Backend\nservicesExperienced with build tools Grunt, Gulp, or Webpack.Familiar with\nGitHub, GItHub Actions, JIRAIf interested, Please share below details with\nupdate resume:Full Name:Phone:E-mail:Rate:Location:Visa Status:Availability:SSN\n(Last 4 digit):Date of Birth:LinkedIn Profile:Availability for the\ninterview:Availability for the project:",
  "requirements": [],
  "postedAt": "2024-10-02T02:41:24.082Z",
  "type": "full-time",
  "remote": false
}