{
  "title": "ReactJS Developer",
  "company": "Unknown Company",
  "location": "San Leandro, CA, ",
  "description": "Company Overview: Req ID: 297453 NTT DATA strives to hire exceptional,\ninnovative and passionate individuals who want to grow with us. If you want to\nbe part of an inclusive, adaptable, and forward-thinking organization, apply\nnow.We are currently seeking a ReactJS Developer to join our team in San\nLeandro, California (US-CA), United States (US).Job Description: Job Duties and\nResponsibilities: In this role, you will:• May require to works on multiple\napplications.• Provides informal mentoring to less experienced colleagues.•\nDevelops innovative and creative output based on interpretation and analysis.•\nParticipates and may lead critical projects, customer engagements or business\nprocesses.• Provides design and documentation at an application or function\ncapability level.• Participates in establishing and maintaining application\nstandards and processes.• Effectively communicates application and technical\ndirection to the business and within the customer's IT organization.• Advises on\nissues of systems integration, compatibility, scalability, and multiple\nplatforms.• Lead moderately complex initiatives and deliverables within\ntechnical domain environments.• Contribute to large scale planning of\nstrategies.• Design, code, test, debug, and document for projects and programs\nassociated with technology domain, including upgrades and deployments.• Review\nmoderately complex technical challenges that require an in-depth evaluation of\ntechnologies and procedures.• Resolve moderately complex issues and lead a team\nto meet existing client needs or potential new client needs while leveraging\nsolid understanding of the function, policies, procedures, or compliance\nrequirements.• Works with Product, Interaction and Visual Designers to implement\nthe next generation User Interface platform & Applications.• Collaborate and\nconsult with peers, colleagues, and mid-level managers to resolve technical\nchallenges and achieve goals.• Lead projects and act as an escalation point,\nprovide guidance and direction to less experienced staff.• Strong verbal and\nwritten communication skills Good analytical skills• Required Qualifications: 5+\nyears of Software Engineering experience• Desired Qualifications: 4+ years of\nexperience with modern HTML, CSS, JavaScript (ES6+), Typescript and writing\nclean, high-quality and developer friendly code. And 4+ years of Web Development\nwith any modern JavaScript Web frameworks such as React JS or similar.•\nExperience with creating near pixel perfect, robust and developer friendly code\nfor user interfaces / Web Applications.• Experience with ReactJS, JestJS, React\nTesting Library (RTL), Webpack, StorybookJS, StencilJS• Experience build RESTFul\nAPI and web services.• Experience with creating large scale Web Applications,\nspecifically with ReactJS.• Familiarity with complex state management,\nspecifically with other state management tools like Redux, RxJS or other\nsimilar.• Experience writing and UI unit tests (Jest, Jasmine, etc.)• Experience\nor strong knowledge in BDD/Automated testing and Accessibility / ADA• Experience\nwith guidance and mentoring of other developers while working on projects and\ninitiatives.• Experience with creating high-performance applications.•\nExperience with code hosting platform for version control and collaboration\ntools like GitHub.• Experience with Project Tracking software like Jira.•\nExperience in using developer tools for troubleshooting the issues.• Experience\nor having knowledge in monitoring applications like Splunk, etc.• Experience or\nhaving strong knowledge working with Content Management Systems (CMS).•\nExperience or having knowledge in using the Interface Design tool like Figma,\nInvision, etc,..Basic Qualifications:• 5+ years of experience in ReactJSAbout\nNTT DATANTT DATA is a $30+ billion trusted global innovator of business and\ntechnology services. We serve 75% of the Fortune Global 100 and are committed to\nhelping clients innovate, optimize and transform for long-term success. As a\nGlobal Top Employer, we have diverse experts in more than 50 countries and a\nrobust partner ecosystem of established and start-up companies. Our services\ninclude business and technology consulting, data and artificial intelligence,\nindustry solutions, as well as the development, implementation and management of\napplications, infrastructure and connectivity. We are also one of the leading\nproviders of digital and AI infrastructure in the world. NTT DATA is part of NTT\nGroup, which invests over $3.6 billion each year in R&D to help organizations\nand society move confidently and sustainably into the digital future. Visit us\nat us.nttdata.com.NTT DATA is an equal opportunity employer and considers all\napplicants without regarding to race, color, religion, citizenship, national\norigin, ancestry, age, sex, sexual orientation, gender identity, genetic\ninformation, physical or mental disability, veteran or marital status, or any\nother characteristic protected by law. We are committed to creating a diverse\nand inclusive environment for all employees. If you need assistance or an\naccommodation due to a disability, please inform your recruiter so that we may\nconnect you with the appropriate team.",
  "requirements": [],
  "postedAt": "2025-01-25T20:09:43.542Z",
  "type": "full-time",
  "remote": false
}