{
  "title": "Technology Developer Venture Startups",
  "company": "Fraunhofer Institute for Telecommunications, Heinrich Hertz Institute (HHI)",
  "location": "Berlin, Germany",
  "description": "The Fraunhofer-Gesellschaft currently operates 76 institutes and research units throughout Germany and is a leading applied research organization. Around 32,000 employees work with an annual research budget of 3.4 billion euros.\n\nIf you're passionate about startups, we're excited to introduce you to this fantastic opportunity at HHI. Our vision? To accelerate the creation of groundbreaking, technology-driven startups. To do this, we rely on talent like YOU - with a mix of deep-tech projects, financial support, professional space, and a strong network of mentors and coaches. The Tech Venture Developer is responsible for identifying, validating, and advancing technological solutions based on HHI research results. This includes prototype development, feasibility assessment, and collaboration with interdisciplinary teams to achieve market readiness.",
  "requirements": [
    "University degree (Bachelor/Master) in computer science, engineering, electrical engineering, or related field",
    "Experience in development and implementation of technological solutions",
    "Sound knowledge in prototypes, software architectures, and IT systems",
    "Experience in working with interdisciplinary teams",
    "Strong skills in leading technical teams",
    "Very good knowledge of German and English",
    "Confident working in dynamic environments"
  ],
  "responsibilities": [
    "Analysis and identification of promising technologies and research results of the HHI",
    "Selection and implementation of suitable technologies and software architectures",
    "Integration of user feedback and market data into technological development",
    "Evaluation of technical feasibility and market potential",
    "Prototyping and implementation in MVPs and scalable systems",
    "Carrying out technology tests and validation processes",
    "Interdisciplinary collaboration with product venture developers",
    "Development of technological roadmaps for product scaling"
  ],
  "salary": "Attractive salary package according to TvöD",
  "type": "full-time",
  "remote": true,
  "postedAt": "2025-01-24T00:00:00.000Z",
  "url": "https://jobs.fraunhofer.de/job/Berlin-Technology-Developer-Venture-Startups-10587/1164002301/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
}